app/controllers/users_controller.rb

SELECT  1 AS one FROM `users` WHERE `users`.`username` = 'Ali' AND `users`.`password` = '1234' LIMIT 1
---
	def verify
		@user = User.new(params.require(:user).permit(:username, :password))
		if User.exists?(username: @user.username, password: @user.password)